Repository: roth-dev/sky-social
Catalog: locale/*/messages.po
Languages: km

source: About
km: អំពី

source: Account
km: គនណី

source: Account Settings
km: ការកំណត់គណនី

source: Active
km: សកម្ម

source: Add another account
km: បន្ថែមគណនីមួយទៀត

source: Add Another Account
km: បន្ថែមគណនីមួយទៀត

source: An unexpected error occurred
km: មានកំហុសដែលមិនបានរំពឹងទុកកើតឡើង

source: App settings
km: ការកំណត់កម្មវិធី

source: App Settings
km: ការកំណត់កម្មវិធី

source: Applying theme...
km: កំពុងអនុវត្តរូបរាង...

source: Are you sure you want to delete your account? This action cannot be undone.
km: តើអ្នកប្រាកដជាចង់លុបគណនីរបស់អ្នកមែនទេ? សកម្មភាពនេះមិនអាចត្រឡប់វិញបានទេ។

source: Auto-download languages
km: ទាញយកភាសាដោយស្វ័យប្រវត្តិ

source: Automatically download language packs when selected
km: ទាញយកកញ្ចប់ភាសាដោយស្វ័យប្រវត្តិនៅពេលត្រូវបានជ្រើសរើស

source: Block @{0}
km: រាំងខ្ទប់ @{0}

source: Block @{0}?
km: រាំងខ្ទប់ @{0}?

source: Blocked
km: បានរាំងខ្ទប់

source: Cancel
km: បោះបង់

source: Cannot Open Link
km: មិនអាចបើកតំណបានទេ

source: Change Email
km: ផ្លាស់ប្តូរអីម៉ែល

source: Change Password
km: ផ្លាស់ប្តូរពាក្យសម្ងាត់

source: Changing language...
km: កំពុងផ្លាស់ប្តូរភាសា...

source: Check your internet connection and try again.
km: ពិនិត្យការតភ្ជាប់អ៊ីនធឺណិតរបស់អ្នក ហើយព្យាយាមម្តងទៀត

source: Configure your profile, security, and privacy settings
km: កំណត់ប្រវត្តិរូប សុវត្ថិភាព និងការកំណត់ឯកជនភាពរបស់អ្នក

source: Confirm Delete
km: បញ្ជាក់ការលុប

source: Connect with the decentralized social web
km: ភ្ជាប់ជាមួយបណ្តាញសង្គមដែលមានលក្ខណៈ decentralized

source: Connection Problem
km: បញ្ហានៃការតភ្ជាប់

source: Content Moderation
km: ការកែតម្រូវខ្លឹមសារ

source: Content will appear here when available.
km: ខ្លឹមសារនឹងបង្ហាញនៅទីនេះនៅពេលមាន

source: Control what content you see and who can interact with you on Sky Social.
km: គ្រប់គ្រងខ្លឹមសារដែលអ្នកឃើញ និងអ្នកដែលអាចទាក់ទងជាមួយអ្នកនៅលើ Sky Social។

source: Copied
km: បានចម្លង

source: Copy link to post
km: ចម្លងតំណទៅកាន់សារ

source: Copy post text
km: ចម្លងអត្ថបទ

source: Copy URL
km: ចម្លង URL

source: Current Account
km: គណនីបច្ចុប្បន្ន

source: Current Language
km: ភាសាបច្ចុប្បន្ន

source: Current Theme
km: រូបរាងបច្ចុប្បន្ន

source: Currently signed in as:
km: បច្ចុប្បន្នបានចូលជា៖

source: Currently: {0}
km: បច្ចុប្បន្ន៖ {0}

source: Customize Your Feed
km: ប្ដូរតាមតម្រូវការព័ត៌មានរបស់អ្នក

source: Dark
km: ងងឹត

source: Data Management
km: ការគ្រប់គ្រងទិន្នន័យ

source: Delete
km: លុប

source: Delete Account
km: លុបគណនី

source: Discover
km: ស្វែងរក

source: Discover posts from the decentralized social web. Sign in to interact with posts and see your personalized timeline.
km: ស្វែងរកការបង្ហោះពីគេហទំព័រសង្គម Decentralized។ ចូល​ដើម្បី​ធ្វើ​អន្តរកម្ម​ជាមួយ​ការ​បង្ហោះ និង​មើល timeline​ ផ្ទាល់ខ្លួន​របស់​អ្នក។

source: Don't have a Bluesky account? Create one at
km: មិនទាន់មានគណនី Bluesky? បង្កើតនៅលើ

source: Edit Profile
km: កែសម្រួលប្រវត្តិរូប

source: Email
km: អ៊ីម៉ែល

source: Enter a search term
km: បញ្ចូលពាក្យស្វែងរក

source: Enter a search term to find people, posts, and feeds on Bluesky.
km: បញ្ចូលពាក្យស្វែងរកដើម្បីស្វែងរកមនុស្ស posts និងមតិព័ត៌មាននៅលើ Bluesky

source: Enter your password
km: បញ្ចូលពាក្យសម្ងាត់របស់អ្នក

source: Error
km: កំហុស

source: Export Data
km: នាំចេញទិន្នន័យ

source: Failed to delete account
km: បរាជ័យក្នុងការលុបគណនី

source: Failed to export your data
km: បរាជ័យក្នុងការនាំចេញទិន្នន័យរបស់អ្នក

source: Failed to save notification settings
km: បរាជ័យក្នុងការរក្សាទុកការកំណត់ការជូនដំណឹង

source: Failed to save your feed preferences. Please try again.
km: បរាជ័យក្នុងការរក្សាទុកចំណូលចិត្តព័ត៌មានរបស់អ្នក។ សូមព្យាយាមម្តងទៀត។

source: Feeds
km: ហ្វីត

source: Final Confirmation
km: ការបញ្ជាក់ចុងក្រោយ

source: Find interesting people and feeds to follow
km: ស្វែងរកមនុស្សគួរឱ្យចាប់អារម្មណ៍ និងព័ត៌មានដើម្បីតាមដាន

source: Follow
km: តាម

source: Follow people to see their posts in your timeline. Discover new accounts in the search tab!
km: តាមដានអ្នកប្រើប្រាស់ផ្សេងទៀតដើម្បីមើលការបង្ហោះរបស់ពួកគេនៅក្នុង timeline របស់អ្នក។ ស្វែងរកគណនីថ្មីនៅក្នុងផ្ទាំងស្វែងរក

source: Followers
km: អ្នកតាម

source: Following
km: កំពុងតាម

source: For You
km: សម្រាប់អ្នក

source: Handle
km: ឈ្មោះគណនី

source: Harassment
km: ការបៀតបៀន

source: Hidden
km: បានលាក់

source: Hide
km: លាក់

source: Hide this post
km: លាក់សារនេះ

source: Hide this post?
km: លាក់សារនេះ?

source: Home
km: ទំព័រដើម

source: Home feed preferences
km: ចំណូលចិត្តព័ត៌មានផ្ទះ

source: Home Feed Preferences
km: ការកំណត់ចំណូលចិត្តព័ត៌មានផ្ទះ

source: Import Data
km: នាំចូលទិន្នន័យ

source: Invalid URL
km: URL មិនត្រឹមត្រូវ

source: Khmer
km: ខ្មែរ

source: Language changes take effect immediately. Some content may require app restart to display in the new language.
km: ការផ្លាស់ប្តូរភាសាមានប្រសិទ្ធភាពភ្លាមៗ។ ខ្លឹមសារមួយចំនួនអាចត្រូវការចាប់ផ្តើមកម្មវិធីឡើងវិញដើម្បីបង្ហាញជាភាសាថ្មី។

source: Language Settings
km: ការកំណត់ភាសា

source: Languages
km: ភាសា

source: Light
km: ពន្លឺ

source: Liked
km: ចូលចិត្ត

source: Likes
km: ចូលចិត្ត

source: Link Error
km: កំហុសតំណ

source: Loading...
km: កំពុងផ្ទុក...

source: Login failed
km: ការចូលបានបរាជ័យ

source: Manage Your Account
km: គ្រប់គ្រងគណនីរបស់អ្នក

source: Media
km: ប្រព័ន្ធផ្សព្វផ្សាយ

source: Mentions
km: ការនៅន្លែង

source: Moderation
km: ការមធ្យាស្ថ

source: More Options
km: ជម្រើសច្រើនទៀត

source: Mute @{0}
km: បិទសំឡេង @{0}

source: Mute @{0}?
km: បិទសំឡេង @{0}?

source: Muted
km: បានបិទសំឡេង

source: No custom feeds found for "{searchQuery}". Try browsing popular feeds instead.
km: រកមិនឃើញព័ត៌មានផ្ទាល់ខ្លួនសម្រាប់ "{searchQuery}" ទេ។ សាកល្បងមើលព័ត៌មានពេញនិយមជំនួសវិញ។

source: No feeds found
km: រកមិនឃើញមតិព័ត៌មានទេ

source: No followers yet
km: មិនទាន់មានអ្នកតាមដាននៅឡើយទេ

source: No liked posts yet
km: មិន​ទាន់​មាន posts ​ដែល​ចូលចិត្ត​នៅ​ឡើយ​ទេ

source: No media yet
km: មិនទាន់មានប្រព័ន្ធផ្សព្វផ្សាយនៅឡើយទេ

source: No people found
km: រកមិនឃើញអ្នកប្រើប្រាស់ទេ

source: No posts found
km: រកមិនឃើញ posts

source: No posts found for "{searchQuery}". Try searching with different keywords.
km: រកមិនឃើញ posts សម្រាប់ "{searchQuery}" ទេ។ ព្យាយាមស្វែងរកដោយប្រើពាក្យគន្លឹះផ្សេងៗ

source: No posts yet
km: មិនទាន់ posts នៅឡើយទេ

source: No results found
km: រកមិនឃើញលទ្ធផល

source: No results found for "{searchQuery}". Try a different search term.
km: រកមិនឃើញលទ្ធផលសម្រាប់ "{searchQuery}" ទេ។ សាកល្បងពាក្យស្វែងរកផ្សេង

source: No suggestions available at the moment
km: មិនមានការណែនាំទេនៅពេលនេះ

source: No text to translate
km: គ្មានអត្ថបទសម្រាប់បកប្រែទេ

source: No users found for "{searchQuery}". Try searching with a different term or handle.
km: រកមិនឃើញអ្នកប្រើប្រាស់សម្រាប់ "{searchQuery}" ទេ។ សាកល្បងស្វែងរកដោយប្រើពាក្យ ឬ handle ផ្សេង

source: Not enabled
km: មិនបានបើក

source: Not following anyone yet
km: មិន​ទាន់​តាម​អ្នក​ណា​ទេ

source: Nothing here yet
km: មិនមានអ្វីនៅទីនេះនៅឡើយទេ

source: now
km: ឥឡូវ

source: Password
km: ពាក្យសម្ងាត់

source: Permanently delete your account
km: លុបគណនីរបស់អ្នកជាអចិន្ត្រៃយ៍

source: Please check your internet connection and try again.
km: សូមពិនិត្យមើលការតភ្ជាប់អ៊ីនធឺណិតរបស់អ្នក ហើយព្យាយាមម្តងទៀត

source: Please fill in all fields
km: សូមបំពេញឱ្យគ្រប់វាល

source: Please sign in to view your personalized feed and interact with posts.
km: សូមចូលដើម្បីមើលព័ត៌មានផ្ទាល់ខ្លួនរបស់អ្នក និងធ្វើអន្តរកម្មជាមួយការបង្ហោះ

source: Posts
km: ការបង្ហោះ

source: Powered by AT Protocol
km: ដំណើរការដោយ AT Protocol

source: Processing...
km: កំពុងដំណើរការ...

source: Profile
km: ប្រវត្តិរូប

source: Profile Information
km: ព័ត៌មានប្រវត្តិរូប

source: Replying to @{0}
km: ឆ្លើយតបទៅ @{0}

source: Report post
km: រាយការណ៍សារ

source: Report this post?
km: រាយការណ៍សារនេះ?

source: Reported
km: បានរាយការណ៍

source: Reposts
km: ការបង្ហោះឡើងវិញ

source: Reset
km: កំណត់ឡើងវិញ

source: Reset all language preferences to defaults
km: កំណត់ចំណូលចិត្តភាសាទាំងអស់ទៅតម្លៃលំនាំដើមវិញ

source: Reset language data
km: កំណត់ទិន្នន័យភាសាឡើងវិញ

source: Reset to Defaults
km: កំណត់ទៅតម្លៃលំនាំដើមវិញ

source: Restore from backup
km: ស្តារពីការបម្រុងទុក

source: Retry
km: ព្យាយាមម្តងទៀត

source: Save Changes
km: រក្សាទុកការផ្លាស់ប្តូរ

source: Search Tips
km: គន្លឹះស្វែងរក

source: Searching for {type}...
km: កំពុងស្វែងរក {type}...

source: Security
km: សុវត្ថិភាព

source: See all
km: មើលទាំងអស់

source: Service Unavailable
km: សេវាកម្មមិនអាចប្រើបានទេ

source: Settings
km: ការកំណត់

source: Share post
km: ចែករំលែកសារ

source: Show original
km: បង្ហាញអត្ថបទដើម

source: Show Sensitive Information
km: បង្ហាញព័ត៌មានរសើប

source: Show translation
km: បង្ហាញការបកប្រែ

source: Sign in
km: ចូលគណនី

source: Sign In
km: ចូលគណនី

source: Sign in required
km: តម្រូវឱ្យចូល

source: Sign in to add another Bluesky account. You can easily switch between accounts in Settings.
km: ចូលដើម្បីបន្ថែមគណនី Bluesky មួយទៀត។ អ្នកអាចប្តូរគណនីបានយ៉ាងងាយស្រួលក្នុងការកំណត់។

source: Sign in to follow people and see more suggestions
km: ចូលដើម្បីតាមដានអ្នកប្រប្រាស់ និងមើលការណែនាំបន្ថែម

source: Sign in to see personalized suggestions
km: ចូលដើម្បីមើលការណែនាំផ្ទាល់ខ្លួន

source: Sign out
km: ចេញ

source: Signing in...
km: កំពុងចូល

source: Sky Social Data Export
km: ការនាំចេញទិន្នន័យ Sky Social

source: Something went wrong
km: មានអ្វីមួយខុសប្រក្រតី

source: Something went wrong while loading the timeline. Please try again.
km: មាន​អ្វី​មួយ​ខុស​ពេល​ផ្ទុក ​timeline ។ សូមព្យាយាមម្តងទៀត

source: Something went wrong while loading your profile.
km: មាន​អ្វី​មួយ​ខុស​ពេល​ផ្ទុក​ព័ត៌មាន​របស់​អ្នក

source: Spam
km: សារចម្លែក

source: Start searching
km: ចាប់ផ្តើមស្វែងរក

source: Success
km: ជោគជ័យ

source: Suggested people
km: មនុស្សដែលបានណែនាំ

source: Switch to Account
km: ប្តូរទៅគណនី

source: System
km: ប្រព័ន្ធ

source: Thank you for your report. We'll review it soon.
km: សូមអរគុណចំពោះរបាយការណ៍របស់អ្នក។ យើងនឹងពិនិត្យវាក្នុងពេលឆាប់ៗនេះ។

source: The service is temporarily unavailable. Please try again in a few moments.
km: សេវាកម្មមិនអាចប្រើបានជាបណ្តោះអាសន្ន។ សូមព្យាយាមម្តងទៀតក្នុងរយៈពេលបន្តិច។

source: Theme
km: ពណ៌

source: Theme changes take effect immediately. System theme follows your device's appearance settings.
km: ការផ្លាស់ប្តូររូបរាងមានប្រសិទ្ធភាពភ្លាមៗ។ រូបរាងប្រព័ន្ធតាមការកំណត់រូបរាងឧបករណ៍របស់អ្នក។

source: Theme Options
km: ជម្រើសរូបរាង

source: Theme Settings
km: ការកំណត់រូបរាង

source: They will no longer be able to follow you or see your posts. You will not see their posts or be notified when they follow you.
km: ពួកគេនឹងមិនអាចតាមដានអ្នក ឬមើលសារបង្ហោះរបស់អ្នកបានទៀតទេ។ អ្នកនឹងមិនឃើញសារបង្ហោះរបស់ពួកគេ ឬទទួលបានការជូនដំណឹងពេលពួកគេតាមដានអ្នកទេ។

source: This link appears to be invalid or malformed.
km: តំណនេះហាក់ដូចជាមិនត្រឹមត្រូវ ឬខុសទម្រង់

source: This link cannot be opened on your device. Would you like to copy the URL?
km: តំណនេះមិនអាចបើកនៅលើឧបករណ៍របស់អ្នកបានទេ។ តើអ្នកចង់ចម្លង URL ទេ

source: This will permanently delete your account and all associated data. Type "DELETE" to confirm.
km: នេះនឹងលុបគណនីរបស់អ្នក និងទិន្នន័យដែលពាក់ព័ន្ធទាំងអស់ជាអចិន្ត្រៃយ៍។ វាយ "DELETE" ដើម្បីបញ្ជាក់។

source: This will reset all feed preferences to their default values. Are you sure?
km: នេះនឹងកំណត់ចំណូលចិត្តព័ត៌មានទាំងអស់ទៅតម្លៃលំនាំដើមវិញ។ តើអ្នកប្រាកដទេ?

source: Translate
km: បកប្រែ

source: Translated by Google Translate
km: បកប្រែដោយ Google Translate

source: Translating...
km: កំពុងបកប្រែ...

source: Translation Error
km: កំហុសការបកប្រែ

source: Translation not needed
km: មិនចាំបាច់បកប្រែទេ

source: Try Again
km: ព្យាយាមម្តងទៀត

source: Try searching for something else or check your spelling.
km: សាកល្បងស្វែងរកអ្វីផ្សេងទៀត ឬពិនិត្យមើលអក្ខរាវិរុទ្ធរបស់អ្នក

source: Two-Factor Authentication
km: ការផ្ទៀងផ្ទាត់ពីរកត្តា

source: Type something to search for people, posts, and feeds.
km: វាយបញ្ចូលអ្វីមួយដើម្បីស្វែងរកមនុស្ស posts និងមតិព័ត៌មាន

source: Unable to load profile
km: មិនអាចផ្ទុកប្រវត្តិរូបបានទេ

source: Unable to load timeline
km: មិនអាចផ្ទុក timeline បានទេ

source: Unable to load video
km: មិនអាចផ្ទុកវីដេអូបានទេ

source: Unable to open this link. Would you like to copy the URL instead?
km: មិនអាចបើកតំណនេះបានទេ។ តើអ្នកចង់ចម្លង URL ជំនួសវិញទេ?

source: URL copied to clipboard
km: URL ត្រូវបានចម្លងទៅ clipboard

source: Username or Email
km: ឈ្មោះអ្នកប្រើប្រាស់ ឬ អីម៉ែល

source: Video
km: វីដេអូ

source: Videos
km: វីដេអូ

source: We encountered an error while loading this content.
km: យើងបានជួបបញ្ហាខណៈពេលកំពុងផ្ទុកខ្លឹមសារនេះ។

source: Welcome to Sky
km: ស្វាគមន័ មកកាន់ Sky

source: Welcome to Sky Social!
km: ស្វាគមន័ មកកាន់ Sky

source: What's on your mind?
km: មានរឿងក្នុងចិត្ត?

source: What's the issue with this post?
km: បញ្ហាអ្វីជាមួយសារនេះ?

source: When people follow this account, they will appear here.
km: នៅពេលដែលមនុស្សតាមដានគណនីនេះ វានឹងបង្ហាញនៅទីនេះ

source: When this user follows people, they will appear here.
km: នៅពេលដែលអ្នកប្រើប្រាស់នេះតាមមអ្នកប្រើប្រាស់ផ្សេងទៀត វានឹងបង្ហាញនៅទីនេះ

source: When this user likes posts, they will appear here.
km: នៅពេលដែលអ្នកប្រើប្រាស់នេះចូលចិត្តការបង្ហោះ វានឹងបង្ហាញនៅទីនេះ

source: When this user posts something, it will appear here.
km: នៅពេលដែលអ្នកប្រើប្រាស់នេះបង្ហោះអ្វីមួយ វានឹងបង្ហាញនៅទីនេះ

source: When this user shares photos and videos, they will appear here.
km: នៅពេលដែលអ្នកប្រើប្រាស់នេះចែករំលែករូបថត និងវីដេអូ វានឹងបង្ហាញនៅទីនេះ

source: Write your reply...
km: សរសេរការឆ្លើយតបរបស់អ្នក

source: You won't see their posts in your timeline, but they can still follow and interact with you.
km: អ្នកនឹងមិនឃើញសារបង្ហោះរបស់ពួកគេនៅក្នុង timeline របស់អ្នកទេ ប៉ុន្តែពួកគេនៅតែអាចតាមដាន និងធ្វើអន្តរកម្មជាមួយអ្នកបាន។

source: You're offline
km: អ្នកគ្មានអ៊ីនធឺណិតទេ

source: Your accounts are stored securely on this device. You can manage and switch between them in Settings.
km: គណនីរបស់អ្នកត្រូវបានរក្សាទុកដោយសុវត្ថិភាពនៅលើឧបករណ៍នេះ។ អ្នកអាចគ្រប់គ្រង និងប្តូររវាងគណនីនៅក្នុងការកំណត់។

source: Your feed preferences have been saved.
km: ចំណូលចិត្តព័ត៌មានរបស់អ្នកត្រូវបានរក្សាទុក។

source: Your privacy and security are important to us. All changes are saved automatically.
km: ឯកជនភាព និងសុវត្ថិភាពរបស់អ្នកមានសារៈសំខាន់សម្រាប់យើង។ ការផ្លាស់ប្តូរទាំងអស់ត្រូវបានរក្សាទុកដោយស្វ័យប្រវត្តិ។

source: Your timeline will appear here once you follow some people and they start posting.
km: timeline របស់អ្នកនឹងបង្ហាញនៅទីនេះ នៅពេលដែលអ្នកតាមដានអ្នកប្រើប្រាស់មួយចំនួន ហើយពួកគេចាប់ផ្តើមបង្ហោះ

source: your.handle or email@example.com
km: handle របស់អ្នក ឬ អីម៉ែល
